Documents/МГС_БракБаллонов_.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>МГС_БракБаллонов_</Name>
			<BasedOn>
				<xr:Item>Document.МГС_ВыпускБаллонов_</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.МГС_ВыпускБаллонов_</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументВыпуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МГС_ВыпускБаллонов_</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Баллоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Баллон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/МГС_БракБаллонов_/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	Если ДанныеЗаполнения<> Неопределено Тогда
		//ЭтотОбъект.Организация = ДанныеЗаполнения.Организация;
		ЭтотОбъект.ДокументВыпуск = ДанныеЗаполнения;
		ЭтотОбъект.Дата= ЭтотОбъект.ДокументВыпуск.Дата+1;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.МГС_ВыпускБаллонов.Записывать = Истина;
	Для Каждого ТекСтрокаБаллоны Из Баллоны Цикл
		Движение = Движения.МГС_ВыпускБаллонов.Добавить();
		Движение.Период = Дата;
		Движение.Баллон = ТекСтрокаБаллоны.Баллон;
		//Движение.Партия = ТекСтрокаБаллоны.Партия;
		Движение.Выпуск = ДокументВыпуск;
		Движение.Состояние =Перечисления.МГС_СостояниеБаллона.Забракованно;
		
	КонецЦикла;
КонецПроцедуры

//Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	// Вставить содержимое обработчика.
//	Если Сертификация.Количество() > 0 и Партии.Количество() = 0 Тогда
//		Для каждого ТекущаяПартия   Из ДокументВыпуск.ПартииБаллоны Цикл
//			НоваяСтрокаПартии = Партии.Добавить();
//			НоваяСтрокаПартии.НомерПартии =ТекущаяПартия.НомерПартии; 	
//		КонецЦикла; 	
//	КонецЕсли; 
//КонецПроцедуры
